# HasCurrent Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSizeSettingIterator..::..HasCurrent Method
ConduitSizeSettingIterator Class See Also
---
Identifies whether the iterator has a current item. There is no current item if the iterator has not started yet or has been done.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool HasCurrent()
```

Visual Basic
---
```text
Public Function HasCurrent As Boolean
```

Visual C++
---
```text
public:
bool HasCurrent()
```

# ### Return Value
True if there is a current item.
# See Also
ConduitSizeSettingIterator Class
Autodesk.Revit.DB.Electrical Namespace